Разработка_GZ/src/Catalogs/ГЗ_ПользователяСистемыВзаимодействия/ГЗ_ПользователяСистемыВзаимодействия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГЗ_ПользователяСистемыВзаимодействия</name>
  <attributes>
    <name>ИДПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Актуален</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРассылки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИДОбсуждения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КритерииПоискаЗакупок</name>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОКПД2</name>
      <type>
        <types>CatalogRef.КлассификаторОКПД2</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеЗакупки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Активно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Разработка_GZ/src/CommonModules/ГЗ_РаботаСБотомиРассылок/Module.bsl
//Пример отправки сообщения
	//Сообщение = СистемаВзаимодействия.СоздатьСообщение(новый ИдентификаторОбсужденияСистемыВзаимодействия("fdb10b67-d1e4-44fb-94aa-22ac7c9fbea0"));
	//Сообщение.Получатели.Добавить(новый ИдентификаторПользователяСистемыВзаимодействия("125541d6-4707-44da-b2a6-307b98db77a6"));
	//Сообщение.Автор = Новый ИдентификаторПользователяСистемыВзаимодействия("125541d6-4707-44da-b2a6-307b98db77a6");
	//
	//Сообщение.Текст = "Тестовое сообщение от бота GZ";
	//
	//Попытка
	//	Сообщение.Записать();
	//Исключение
	//	
	//КонецПопытки;
Процедура ОтправитьСообщениеПользователюТелеграмм(ИДПользователя, ИДОбсуждения, ТекстСообщения, ТаблицаОповещения) Экспорт 
	
	Сообщение = СистемаВзаимодействия.СоздатьСообщение(новый ИдентификаторОбсужденияСистемыВзаимодействия(ИДОбсуждения));
	
	Сообщение.Получатели.Добавить(новый ИдентификаторПользователяСистемыВзаимодействия(ИДПользователя));
	
	Сообщение.Автор = Новый ИдентификаторПользователяСистемыВзаимодействия("125541d6-4707-44da-b2a6-307b98db77a6");//Отправка от пользователя 1С
	
	Сообщение.Текст = ТекстСообщения;
	
	Попытка
		Сообщение.Записать();
	Исключение
		
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Истина);

КонецПроцедуры

Процедура ГЗ_РассылкаСообщенийБотомВТелеграмм() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГЗ_ПользователяСистемыВзаимодействияКритерииПоискаЗакупок.Ссылка КАК Ссылка,
		|	ГЗ_ПользователяСистемыВзаимодействияКритерииПоискаЗакупок.Регион КАК Регион,
		|	ГЗ_ПользователяСистемыВзаимодействияКритерииПоискаЗакупок.ОКПД2 КАК ОКПД2,
		|	ГЗ_ПользователяСистемыВзаимодействияКритерииПоискаЗакупок.Организация КАК Организация,
		|	ГЗ_ПользователяСистемыВзаимодействияКритерииПоискаЗакупок.Сумма КАК Сумма,
		|	ГЗ_ПользователяСистемыВзаимодействияКритерииПоискаЗакупок.НаименованиеЗакупки КАК НаименованиеЗакупки,
		|	ГЗ_ПользователяСистемыВзаимодействияКритерииПоискаЗакупок.Активно КАК Активно,
		|	ГЗ_ПользователяСистемыВзаимодействияКритерииПоискаЗакупок.Ссылка.ИДПользователя КАК ИДПользователя,
		|	ГЗ_ПользователяСистемыВзаимодействияКритерииПоискаЗакупок.Ссылка.ИДОбсуждения КАК ИДОбсуждения
		|ИЗ
		|	Справочник.ГЗ_ПользователяСистемыВзаимодействия.КритерииПоискаЗакупок КАК ГЗ_ПользователяСистемыВзаимодействияКритерииПоискаЗакупок
		|ГДЕ
		|	ГЗ_ПользователяСистемыВзаимодействияКритерииПоискаЗакупок.Ссылка.Актуален = ИСТИНА
		|	И ГЗ_ПользователяСистемыВзаимодействияКритерииПоискаЗакупок.Активно = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда 
	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ГЗ_ФормированиеДанныхДляРассылкиБотом() Экспорт
	// Вставить содержимое обработчика.
КонецПроцедуры
